Функция ПолучитьЦенуИОстаток(Номенклатура, Склад, Партнер) Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить("Цена", 0);
    Результат.Вставить("ДоступныйОстаток", 0);
    
    ЗапросЦены = Новый Запрос;
    ЗапросЦены.Текст = 
        "ВЫБРАТЬ
        |	ЦеныСрез.Цена КАК Цена
        |ИЗ
        |	РегистрСведений.Цены.СрезПоследних(
        |			,
        |			Номенклатура = &Номенклатура
        |				И Партнер = &Партнер) КАК ЦеныСрез"; 
	
    ЗапросЦены.УстановитьПараметр("Номенклатура", Номенклатура);
    ЗапросЦены.УстановитьПараметр("Партнер", Партнер);
    
    Выборка = ЗапросЦены.Выполнить().Выбрать(); 
	
    Если Выборка.Следующий() Тогда
        Результат.Цена = Выборка.Цена;
	КонецЕсли;  
	
    
    ЗапросОстатка = Новый Запрос;
    ЗапросОстатка.Текст = 
	 "ВЫБРАТЬ
	 |	ТоварыНаСкладахОстатки.ФизическийОстатокОстаток КАК ДоступныйОстаток
	 |ИЗ
	 |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	 |			,
	 |			Номенклатура = &Номенклатура
	 |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
    ЗапросОстатка.УстановитьПараметр("Склад", Склад);
    ЗапросОстатка.УстановитьПараметр("Номенклатура", Номенклатура);
    
    Выборка = ЗапросОстатка.Выполнить().Выбрать(); 
	
    Если Выборка.Следующий() Тогда
        Результат.ДоступныйОстаток = Выборка.ДоступныйОстаток;
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции