&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьВиджеты_Асинхронно();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьВиджеты_Асинхронно()
	
	Элементы.Обновление.Видимость = Истина;
	
	ВиджетВсегоЗарезервировано = Ждать(РабочийСтолСервер.KPIВсегоЗарезервировано());
	ВиджетКвотыНаПределе = Ждать(РабочийСтолСервер.KPIКвотыНаПределе());
	ВиджетПозицииДефицита = Ждать(РабочийСтолСервер.KPIПозицииДефицита());
	ВиджетРезервовЗаНеделю = Ждать(РабочийСтолСервер.KPIРезервовЗаНеделю());
	
	Элементы.Обновление.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРезервирование(Команда)
	
	ОткрытьФорму("Документ.РезервированиеТоваров.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриход(Команда)
	
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКвоту(Команда)
	
	ОткрытьФорму("Документ.УстановкаКвот.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезервирования(Команда)
	
	ОткрытьФорму("Документ.РезервированиеТоваров.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВиджеты(Команда)
	
	ЗагрузитьВиджеты_Асинхронно();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаРезервНажатие(Элемент)
	ОткрытьФорму("Документ.РезервированиеТоваров.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СсылкаКвотыНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.КвотыНаПределе");
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДефицитНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.ПозицииДефицита");
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНеделяНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.РезервированияЗаНеделю");
КонецПроцедуры
