
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	// регистр КвотыПартнеров 
	Движения.КвотыПартнеров.Записывать = Истина;
	Движение = Движения.КвотыПартнеров.Добавить();
	Движение.Период = Дата;
	Движение.Партнер = Партнер;
	Движение.ГруппаНоменклатуры = Группа;
	Движение.Количество = Квота;

КонецПроцедуры
